# WallAreaBoundaryOverlap Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..WallAreaBoundaryOverlap Property
BuiltInFailures..::..OverlapFailures Class See Also
---
Wall and area boundary line overlap. Color fills, area tags and areas may not behave correctly.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WallAreaBoundaryOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallAreaBoundaryOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WallAreaBoundaryOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace